CSI API ETABS v1

# cDStCanadian_S16_19 Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cDStCanadian_S16_19

    Public Interface cDStCanadian_S16_19

    Dim instance As cDStCanadian_S16_19

    public interface class cDStCanadian_S16_19

    type cDStCanadian_S16_19 =  interface end

The cDStCanadian_S16_19 type exposes the following members.

Methods

| Name| Description
---|---|---
|
GetOverwrite|  Retrieves the value
of a steel design overwrite item
|
GetPreference|  Retrieves the
value of a steel design preference item
|
SetOverwrite|  Sets the value of a
steel design overwrite item
|
SetPreference|  Sets the value of
a steel design preference item
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com